sengeiou/UI_esp32/firmware/sdkconfig.defaults
CONFIG_MBEDTLS_ECP_RESTARTABLE=y
CONFIG_MBEDTLS_CMAC_C=y
CONFIG_MBEDTLS_HARDWARE_AES=y
CONFIG_MBEDTLS_AES_USE_INTERRUPT=y
CONFIG_MBEDTLS_HARDWARE_MPI=y
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_ROM_MD5=y
# CONFIG_MBEDTLS_ATCA_HW_ECDSA_SIGN is not set
# CONFIG_MBEDTLS_ATCA_HW_ECDSA_VERIFY is not set
CONFIG_MBEDTLS_HAVE_TIME=y
# CONFIG_MBEDTLS_HAVE_TIME_DATE is not set
CONFIG_MBEDTLS_ECDSA_DETERMINISTIC=y
CONFIG_MBEDTLS_SHA512_C=y
# CONFIG_MBEDTLS_TLS_SERVER_AND_CLIENT is not set
# CONFIG_MBEDTLS_TLS_SERVER_ONLY is not set
CONFIG_MBEDTLS_TLS_CLIENT_ONLY=y
# CONFIG_MBEDTLS_TLS_DISABLED is not set
CONFIG_MBEDTLS_TLS_CLIENT=y
CONFIG_MBEDTLS_TLS_ENABLED=y

#
# TLS Key Exchange Methods
#
CONFIG_MBEDTLS_PSK_MODES=y
CONFIG_MBEDTLS_KEY_EXCHANGE_PSK=y
CONFIG_MBEDTLS_KEY_EXCHANGE_DHE_PSK=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_PSK=y
CONFIG_MBEDTLS_KEY_EXCHANGE_RSA_PSK=y
CONFIG_MBEDTLS_KEY_EXCHANGE_RSA=y
CONFIG_MBEDTLS_KEY_EXCHANGE_DHE_RSA=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ELLIPTIC_CURVE=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_RSA=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_ECDSA=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDH_ECDSA=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDH_RSA=y
# end of TLS Key Exchange Methods

CONFIG_MBEDTLS_SSL_RENEGOTIATION=y
# CONFIG_MBEDTLS_SSL_PROTO_SSL3 is not set
# CONFIG_MBEDTLS_SSL_PROTO_TLS1 is not set
# CONFIG_MBEDTLS_SSL_PROTO_TLS1_1 is not set
CONFIG_MBEDTLS_SSL_PROTO_TLS1_2=y
# CONFIG_MBEDTLS_SSL_PROTO_GMTSSL1_1 is not set
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_MBEDTLS_SSL_ALPN=y
CONFIG_MBEDTLS_CLIENT_SSL_SESSION_TICKETS=y
CONFIG_MBEDTLS_X509_CHECK_KEY_USAGE=y
CONFIG_MBEDTLS_X509_CHECK_EXTENDED_KEY_USAGE=y
# CONFIG_MBEDTLS_SERVER_SSL_SESSION_TICKETS is not set

#
# Symmetric Ciphers
#
CONFIG_MBEDTLS_AES_C=y
# CONFIG_MBEDTLS_CAMELLIA_C is not set
# CONFIG_MBEDTLS_DES_C is not set
CONFIG_MBEDTLS_RC4_DISABLED=y
# CONFIG_MBEDTLS_RC4_ENABLED_NO_DEFAULT is not set
# CONFIG_MBEDTLS_RC4_ENABLED is not set
# CONFIG_MBEDTLS_BLOWFISH_C is not set
# CONFIG_MBEDTLS_XTEA_C is not set
CONFIG_MBEDTLS_CCM_C=y
CONFIG_MBEDTLS_GCM_C=y
# CONFIG_MBEDTLS_NIST_KW_C is not set
# end of Symmetric Ciphers

# CONFIG_MBEDTLS_RIPEMD160_C is not set

#
# Certificates
#
CONFIG_MBEDTLS_PEM_PARSE_C=y
CONFIG_MBEDTLS_PEM_WRITE_C=y
# CONFIG_MBEDTLS_X509_CRL_PARSE_C is not set
# CONFIG_MBEDTLS_X509_CSR_PARSE_C is not set
# end of Certificates

CONFIG_MBEDTLS_ECP_C=y
CONFIG_MBEDTLS_ECDH_C=y
CONFIG_MBEDTLS_ECDSA_C=y
# CONFIG_MBEDTLS_ECJPAKE_C is not set
CONFIG_MBEDTLS_ECP_DP_SECP192R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_SECP224R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_SECP256R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_SECP384R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_SECP521R1_ENABLED=y
# CONFIG_MBEDTLS_ECP_DP_SECP192K1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP224K1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_SECP256K1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_BP256R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_BP384R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_BP512R1_ENABLED is not set
# CONFIG_MBEDTLS_ECP_DP_CURVE25519_ENABLED is not set
# CONFIG_MBEDTLS_ECP_NIST_OPTIM is not set
# CONFIG_MBEDTLS_POLY1305_C is not set
# CONFIG_MBEDTLS_CHACHA20_C is not set
# CONFIG_MBEDTLS_HKDF_C is not set
# CONFIG_MBEDTLS_THREADING_C is not set
# CONFIG_MBEDTLS_LARGE_KEY_SOFTWARE_MPI is not set
# CONFIG_MBEDTLS_SECURITY_RISKS is not set
# end of mbedTLS

#
# mDNS
#
CONFIG_MDNS_MAX_SERVICES=10
CONFIG_MDNS_TASK_PRIORITY=1
CONFIG_MDNS_TASK_STACK_SIZE=4096
# CONFIG_MDNS_TASK_AFFINITY_NO_AFFINITY is not set
CONFIG_MDNS_TASK_AFFINITY_CPU0=y
# CONFIG_MDNS_TASK_AFFINITY_CPU1 is not set
CONFIG_MDNS_TASK_AFFINITY=0x0
CONFIG_MDNS_SERVICE_ADD_TIMEOUT_MS=2000
# CONFIG_MDNS_STRICT_MODE is not set
CONFIG_MDNS_TIMER_PERIOD_MS=100
# CONFIG_MDNS_NETWORKING_SOCKET is not set
CONFIG_MDNS_MULTIPLE_INSTANCE=y
# end of mDNS

#
# ESP-MQTT Configurations
#
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE=y
# CONFIG_MQTT_MSG_ID_INCREMENTAL is not set
# CONFIG_MQTT_SKIP_PUBLISH_IF_DISCONNECTED is not set
# CONFIG_MQTT_REPORT_DELETED_MESSAGES is not set
# CONFIG_MQTT_USE_CUSTOM_CONFIG is not set
# CONFIG_MQTT_TASK_CORE_SELECTION_ENABLED is not set
# CONFIG_MQTT_CUSTOM_OUTBOX is not set
# end of ESP-MQTT Configurations

#
# Newlib
#
CONFIG_NEWLIB_STDOUT_LINE_ENDING_CRLF=y
# CONFIG_NEWLIB_STDOUT_LINE_ENDING_LF is not set
# CONFIG_NEWLIB_STDOUT_LINE_ENDING_CR is not set
# CONFIG_NEWLIB_STDIN_LINE_ENDING_CRLF is not set
# CONFIG_NEWLIB_STDIN_LINE_ENDING_LF is not set
CONFIG_NEWLIB_STDIN_LINE_ENDING_CR=y
# CONFIG_NEWLIB_NANO_FORMAT is not set
# end of Newlib

#
# NVS
#
# end of NVS

#
# OpenSSL
#
# CONFIG_OPENSSL_DEBUG is not set
CONFIG_OPENSSL_ERROR_STACK=y
# CONFIG_OPENSSL_ASSERT_DO_NOTHING is not set
CONFIG_OPENSSL_ASSERT_EXIT=y
# end of OpenSSL

#
# OpenThread
#
# CONFIG_OPENTHREAD_ENABLED is not set
# end of OpenThread

#
# PThreads
#
CONFIG_PTHREAD_TASK_PRIO_DEFAULT=5
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=3072
CONFIG_PTHREAD_STACK_MIN=768
CONFIG_PTHREAD_DEFAULT_CORE_NO_AFFINITY=y
# CONFIG_PTHREAD_DEFAULT_CORE_0 is not set
# CONFIG_PTHREAD_DEFAULT_CORE_1 is not set
CONFIG_PTHREAD_TASK_CORE_DEFAULT=-1
CONFIG_PTHREAD_TASK_NAME_DEFAULT="pthread"
# end of PThreads

#
# SPI Flash driver
#
# CONFIG_SPI_FLASH_VERIFY_WRITE is not set
# CONFIG_SPI_FLASH_ENABLE_COUNTERS is not set
CONFIG_SPI_FLASH_ROM_DRIVER_PATCH=y
# CONFIG_SPI_FLASH_ROM_IMPL is not set
CONFIG_SPI_FLASH_DANGEROUS_WRITE_ABORTS=y
# CONFIG_SPI_FLASH_DANGEROUS_WRITE_FAILS is not set
# CONFIG_SPI_FLASH_DANGEROUS_WRITE_ALLOWED is not set
# CONFIG_SPI_FLASH_USE_LEGACY_IMPL is not set
# CONFIG_SPI_FLASH_SHARE_SPI1_BUS is not set
# CONFIG_SPI_FLASH_BYPASS_BLOCK_ERASE is not set
CONFIG_SPI_FLASH_YIELD_DURING_ERASE=y
CONFIG_SPI_FLASH_ERASE_YIELD_DURATION_MS=20
CONFIG_SPI_FLASH_ERASE_YIELD_TICKS=1
CONFIG_SPI_FLASH_WRITE_CHUNK_SIZE=8192
# CONFIG_SPI_FLASH_SIZE_OVERRIDE is not set
# CONFIG_SPI_FLASH_CHECK_ERASE_TIMEOUT_DISABLED is not set
# CONFIG_SPI_FLASH_OVERRIDE_CHIP_DRIVER_LIST is not set

#
# Auto-detect flash chips
#
CONFIG_SPI_FLASH_SUPPORT_ISSI_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_MXIC_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_WINBOND_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_BOYA_CHIP=y
CONFIG_SPI_FLASH_SUPPORT_MXIC_OPI_CHIP=y
# end of Auto-detect flash chips

CONFIG_SPI_FLASH_ENABLE_ENCRYPTED_READ_WRITE=y
# end of SPI Flash driver

#
# SPIFFS Configuration
#
CONFIG_SPIFFS_MAX_PARTITIONS=6

#
# SPIFFS Cache Configuration
#
CONFIG_SPIFFS_CACHE=y
CONFIG_SPIFFS_CACHE_WR=y
# CONFIG_SPIFFS_CACHE_STATS is not set
# end of SPIFFS Cache Configuration

CONFIG_SPIFFS_PAGE_CHECK=y
CONFIG_SPIFFS_GC_MAX_RUNS=10
# CONFIG_SPIFFS_GC_STATS is not set
CONFIG_SPIFFS_PAGE_SIZE=256
CONFIG_SPIFFS_OBJ_NAME_LEN=32
# CONFIG_SPIFFS_FOLLOW_SYMLINKS is not set
CONFIG_SPIFFS_USE_MAGIC=y
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y
CONFIG_SPIFFS_META_LENGTH=4
CONFIG_SPIFFS_USE_MTIME=y

#
# Debug Configuration
#
# CONFIG_SPIFFS_DBG is not set
# CONFIG_SPIFFS_API_DBG is not set
# CONFIG_SPIFFS_GC_DBG is not set
# CONFIG_SPIFFS_CACHE_DBG is not set
# CONFIG_SPIFFS_CHECK_DBG is not set
# CONFIG_SPIFFS_TEST_VISUALISATION is not set
# end of Debug Configuration
# end of SPIFFS Configuration

#
# TCP Transport
#

#
# Websocket
#
CONFIG_WS_TRANSPORT=y
CONFIG_WS_BUFFER_SIZE=1024
# end of Websocket
# end of TCP Transport

#
# TinyUSB Stack
#
# CONFIG_TINYUSB is not set
# end of TinyUSB Stack

#
# Unity unit testing library
#
CONFIG_UNITY_ENABLE_FLOAT=y
CONFIG_UNITY_ENABLE_DOUBLE=y
# CONFIG_UNITY_ENABLE_64BIT is not set
# CONFIG_UNITY_ENABLE_COLOR is not set
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y
# CONFIG_UNITY_ENABLE_FIXTURE is not set
# CONFIG_UNITY_ENABLE_BACKTRACE_ON_FAIL is not set
# end of Unity unit testing library

#
# USB-OTG
#
CONFIG_USB_OTG_SUPPORTED=y
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y
# CONFIG_USB_HOST_HW_BUFFER_BIAS_IN is not set
# CONFIG_USB_HOST_HW_BUFFER_BIAS_PERIODIC_OUT is not set
# end of USB-OTG

#
# Virtual file system
#
CONFIG_VFS_SUPPORT_IO=y
CONFIG_VFS_SUPPORT_DIR=y
CONFIG_VFS_SUPPORT_SELECT=y
CONFIG_VFS_SUPPRESS_SELECT_DEBUG_OUTPUT=y
CONFIG_VFS_SUPPORT_TERMIOS=y

#
# Host File System I/O (Semihosting)
#
CONFIG_VFS_SEMIHOSTFS_MAX_MOUNT_POINTS=1
CONFIG_VFS_SEMIHOSTFS_HOST_PATH_MAX_LEN=128
# end of Host File System I/O (Semihosting)
# end of Virtual file system

#
# Wear Levelling
#
# CONFIG_WL_SECTOR_SIZE_512 is not set
CONFIG_WL_SECTOR_SIZE_4096=y
CONFIG_WL_SECTOR_SIZE=4096
# end of Wear Levelling

#
# Wi-Fi Provisioning Manager
#
CONFIG_WIFI_PROV_SCAN_MAX_ENTRIES=16
CONFIG_WIFI_PROV_AUTOSTOP_TIMEOUT=30
# end of Wi-Fi Provisioning Manager

#
# Supplicant
#
CONFIG_WPA_MBEDTLS_CRYPTO=y
# CONFIG_WPA_WAPI_PSK is not set
# CONFIG_WPA_SUITE_B_192 is not set
# CONFIG_WPA_DEBUG_PRINT is not set
# CONFIG_WPA_TESTING_OPTIONS is not set
# CONFIG_WPA_WPS_STRICT is not set
# CONFIG_WPA_11KV_SUPPORT is not set
# end of Supplicant

#
# Bus Options
#

#
# I2C Bus Options
#
CONFIG_I2C_BUS_DYNAMIC_CONFIG=y
CONFIG_I2C_MS_TO_WAIT=5000
# end of I2C Bus Options
# end of Bus Options

#
# LCD Drivers
#

#
# Select Screen Controller
#
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_ILI9341 is not set
CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_ILI9486=y
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_ILI9806 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_ILI9488 is not set
CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_NT35510=y
CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_RM68120=y
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_SSD1351 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_SSD1963 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_ST7789 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_ST7796 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_SSD1306 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_SSD1307 is not set
# CONFIG_LCD_DRIVER_SCREEN_CONTROLLER_SSD1322 is not set
# end of Select Screen Controller
# end of LCD Drivers

#
# Touch Screen Driver
#

#
# Choose Touch Screen Driver
#
# CONFIG_TOUCH_DRIVER_XPT2046 is not set
CONFIG_TOUCH_DRIVER_FT5X06=y
# CONFIG_TOUCH_DRIVER_NS2016 is not set
# end of Choose Touch Screen Driver

CONFIG_TOUCH_PANEL_MAX_CALIBRATE_ERROR=100
CONFIG_TOUCH_PANEL_THRESHOLD_PRESS=150
# end of Touch Screen Driver

#
# LVGL configuration
#
CONFIG_LVGL_DRIVER_TOUCH_SCREEN_ENABLE=y
# CONFIG_LVGL_COLOR_SCREEN_TRANSP is not set
CONFIG_LVGL_ANTIALIAS=y
CONFIG_LVGL_DISP_DEF_REFR_PERIOD=30
CONFIG_LVGL_DPI=130
CONFIG_LVGL_DISP_SMALL_LIMIT=30
CONFIG_LVGL_DISP_MEDIUM_LIMIT=50
CONFIG_LVGL_DISP_LARGE_LIMIT=70

#
# Font usage
#
CONFIG_LVGL_FONT_FMT_TXT_LARGE=y
# CONFIG_LVGL_FONT_SUBPX_BGR is not set

#
# Enable built-in fonts
#
# CONFIG_LVGL_FONT_MONTSERRAT_12 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_14 is not set
CONFIG_LVGL_FONT_MONTSERRAT_16=y
# CONFIG_LVGL_FONT_MONTSERRAT_18 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_20 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_22 is not set
CONFIG_LVGL_FONT_MONTSERRAT_24=y
# CONFIG_LVGL_FONT_MONTSERRAT_26 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_28 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_30 is not set
CONFIG_LVGL_FONT_MONTSERRAT_32=y
# CONFIG_LVGL_FONT_MONTSERRAT_34 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_36 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_38 is not set
CONFIG_LVGL_FONT_MONTSERRAT_40=y
# CONFIG_LVGL_FONT_MONTSERRAT_42 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_44 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_46 is not set
# CONFIG_LVGL_FONT_MONTSERRAT_48 is not set
# CONFIG_LVGL_FONT_UNSCII8 is not set
# CONFIG_LVGL_FONT_MONTSERRAT12SUBPIX is not set
# CONFIG_LVGL_FONT_MONTSERRAT28COMPRESSED is not set
# CONFIG_LVGL_FONT_DEJAVU_16_PERSIAN_HEBREW is not set
# CONFIG_LVGL_FONT_SIMSUN_16_CJK is not set
# end of Enable built-in fonts

# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_12 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_14 is not set
CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_16=y
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_18 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_20 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_22 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_24 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_26 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_28 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_30 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_32 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_34 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_36 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_38 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_40 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_42 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_44 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_46 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT_48 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_UNSCII8 is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT12SUBPIX is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_MONTSERRAT28COMPRESSED is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_DEJAVU_16_PERSIAN_HEBREW is not set
# CONFIG_LVGL_FONT_DEFAULT_SMALL_SIMSUN_16_CJK is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_12 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_14 is not set
CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_16=y
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_18 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_20 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_22 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_24 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_26 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_28 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_30 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_32 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_34 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_36 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_38 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_40 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_42 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_44 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_46 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT_48 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_UNSCII8 is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT12SUBPIX is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_MONTSERRAT28COMPRESSED is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_DEJAVU_16_PERSIAN_HEBREW is not set
# CONFIG_LVGL_FONT_DEFAULT_NORMAL_SIMSUN_16_CJK is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_12 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_14 is not set
CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_16=y
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_18 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_20 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_22 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_24 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_26 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_28 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_30 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_32 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_34 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_36 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_38 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_40 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_42 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_44 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_46 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT_48 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_UNSCII8 is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT12SUBPIX is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_MONTSERRAT28COMPRESSED is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_DEJAVU_16_PERSIAN_HEBREW is not set
# CONFIG_LVGL_FONT_DEFAULT_SUBTITLE_SIMSUN_16_CJK is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_12 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_14 is not set
CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_16=y
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_18 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_20 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_22 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_24 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_26 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_28 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_30 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_32 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_34 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_36 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_38 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_40 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_42 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_44 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_46 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT_48 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_UNSCII8 is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT12SUBPIX is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_MONTSERRAT28COMPRESSED is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_DEJAVU_16_PERSIAN_HEBREW is not set
# CONFIG_LVGL_FONT_DEFAULT_TITLE_SIMSUN_16_CJK is not set
# end of Font usage

#
# Theme usage
#

#
# Enable theme usage, always enable at least one theme
#
# CONFIG_LVGL_THEME_EMPTY is not set
# CONFIG_LVGL_THEME_TEMPLATE is not set
CONFIG_LVGL_THEME_MATERIAL=y
# CONFIG_LVGL_THEME_MONO is not set
# end of Enable theme usage, always enable at least one theme

