sengeiou/UI_esp32/firmware/sdkconfig.defaults
# CONFIG_LVGL_THEME_DEFAULT_INIT_EMPTY is not set
# CONFIG_LVGL_THEME_DEFAULT_INIT_TEMPLATE is not set
CONFIG_LVGL_THEME_DEFAULT_INIT_MATERIAL=y
# CONFIG_LVGL_THEME_DEFAULT_INIT_MONO is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_WHITE is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_SILVER is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_GRAY is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_BLACK is not set
CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_RED=y
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_MAROON is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_YELLOW is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_OLIVE is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_LIME is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_GREEN is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_CYAN is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_AQUA is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_TEAL is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_BLUE is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_NAVY is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_MAGENTA is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_PURPLE is not set
# CONFIG_LVGL_THEME_DEFAULT_PRIMARY_COLOR_ORANGE is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_WHITE is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_SILVER is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_GRAY is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_BLACK is not set
CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_RED=y
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_MAROON is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_YELLOW is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_OLIVE is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_LIME is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_GREEN is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_CYAN is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_AQUA is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_TEAL is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_BLUE is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_NAVY is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_MAGENTA is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_PURPLE is not set
# CONFIG_LVGL_THEME_DEFAULT_SECONDARY_COLOR_ORANGE is not set
CONFIG_LVGL_THEME_DEFAULT_FLAG_LIGHT=y
# CONFIG_LVGL_THEME_DEFAULT_FLAG_DARK is not set
# end of Theme usage

#
# Memory manager settings
#
CONFIG_LVGL_MEM_SIZE=32
# end of Memory manager settings

#
# Log Settings
#
# CONFIG_LVGL_USE_LOG is not set
CONFIG_LVGL_LOG_PRINTF=y
# end of Log Settings

#
# Debug Settings
#
# CONFIG_LVGL_USE_DEBUG is not set
# CONFIG_LVGL_USE_ASSERT_NULL is not set
# CONFIG_LVGL_USE_ASSERT_MEM is not set
# CONFIG_LVGL_USE_ASSERT_MEM_INTEGRITY is not set
# CONFIG_LVGL_USE_ASSERT_STR is not set
# CONFIG_LVGL_USE_ASSERT_OBJ is not set
# CONFIG_LVGL_USE_ASSERT_STYLE is not set
# end of Debug Settings

#
# Text Settings
#
CONFIG_LVGL_TXT_ENC_UTF8=y
# CONFIG_LVGL_TXT_ENC_ASCII is not set
CONFIG_LVGL_TXT_BREAK_CHARS=" ,.;:-_"
CONFIG_LVGL_TXT_LINE_BREAK_LONG_LEN=0
CONFIG_LVGL_TXT_LINE_BREAK_LONG_PRE_MIN_LEN=3
CONFIG_LVGL_TXT_LINE_BREAK_LONG_POST_MIN_LEN=3
CONFIG_LVGL_TXT_COLOR_CMD="#"
CONFIG_LVGL_BIDI_NO_SUPPORT=y
# CONFIG_LVGL_BIDI_DIR_LTR is not set
# CONFIG_LVGL_BIDI_DIR_RTL is not set
# CONFIG_LVGL_BIDI_DIR_AUTO is not set
# CONFIG_LVGL_USE_ARABIC_PERSIAN_CHARS is not set
# CONFIG_LVGL_SPRINTF_CUSTOM is not set
# CONFIG_LVGL_SPRINTF_DISABLE_FLOAT is not set
# end of Text Settings

#
# Widgets
#
CONFIG_LVGL_USE_OBJ_REALIGN=y
# CONFIG_LVGL_EXT_CLICK_AREA_OFF is not set
CONFIG_LVGL_EXT_CLICK_AREA_TINY=y
# CONFIG_LVGL_EXT_CLICK_AREA_FULL is not set
CONFIG_LVGL_WIDGETS_USE_ARC=y
CONFIG_LVGL_WIDGETS_USE_BAR=y
CONFIG_LVGL_WIDGETS_USE_BTN=y
CONFIG_LVGL_WIDGETS_USE_BTNMATRIX=y
# CONFIG_LVGL_WIDGETS_USE_CALENDAR is not set
CONFIG_LVGL_WIDGETS_USE_CANVAS=y
CONFIG_LVGL_WIDGETS_USE_CHECKBOX=y
CONFIG_LVGL_WIDGETS_USE_CHART=y
CONFIG_LVGL_WIDGETS_CHART_AXIS_MAX_LEN=256
CONFIG_LVGL_WIDGETS_USE_CONTAINER=y
# CONFIG_LVGL_WIDGETS_USE_CPICKER is not set
CONFIG_LVGL_WIDGETS_USE_DROPDOWN=y
# CONFIG_LVGL_WIDGETS_USE_GAUGE is not set
CONFIG_LVGL_WIDGETS_USE_IMG=y
CONFIG_LVGL_WIDGETS_USE_IMGBTN=y
CONFIG_LVGL_WIDGETS_USE_KEYBOARD=y
CONFIG_LVGL_WIDGETS_USE_LABEL=y
CONFIG_LVGL_WIDGETS_LABEL_DEF_SCROLL_SPEED=25
CONFIG_LVGL_WIDGETS_LABEL_WAIT_CHAR_COUNT=3
# CONFIG_LVGL_WIDGETS_USE_LED is not set
CONFIG_LVGL_WIDGETS_LED_BRIGHT_MIN=120
CONFIG_LVGL_WIDGETS_LED_BRIGHT_MAX=255
CONFIG_LVGL_WIDGETS_USE_LINE=y
CONFIG_LVGL_WIDGETS_USE_LIST=y
CONFIG_LVGL_WIDGETS_LIST_DEFAULT_ANIMATION_TIME=100
# CONFIG_LVGL_WIDGETS_USE_LINEMETER is not set
# CONFIG_LVGL_WIDGETS_USE_OBJMASK is not set
CONFIG_LVGL_WIDGETS_USE_MSGBOX=y
CONFIG_LVGL_WIDGETS_USE_PAGE=y
CONFIG_LVGL_WIDGETS_PAGE_ANIMATION_DEFAULT_TIME=100
CONFIG_LVGL_WIDGETS_USE_SPINNER=y
CONFIG_LVGL_WIDGETS_SPINNER_DEF_ARC_LENGTH=60
CONFIG_LVGL_WIDGETS_SPINNER_DEF_SPIN_TIME=1000
CONFIG_LVGL_WIDGETS_USE_ROLLER=y
CONFIG_LVGL_WIDGETS_ROLLER_DEF_ANIM_TIME=200
CONFIG_LVGL_WIDGETS_ROLLER_INF_PAGES=7
CONFIG_LVGL_WIDGETS_USE_SLIDER=y
CONFIG_LVGL_WIDGETS_USE_SPINBOX=y
CONFIG_LVGL_WIDGETS_USE_SWITCH=y
CONFIG_LVGL_WIDGETS_USE_TEXTAREA=y
CONFIG_LVGL_WIDGETS_TEXTAREA_DEF_CURSOR_BLINK_TIME=400
CONFIG_LVGL_WIDGETS_TEXTAREA_DEF_PWN_SHOW_TIME=1500
CONFIG_LVGL_WIDGETS_USE_TABLE=y
CONFIG_LVGL_WIDGETS_TABLE_COL_MAX=4
CONFIG_LVGL_WIDGETS_USE_TABVIEW=y
CONFIG_LVGL_WIDGETS_TABVIEW_SLIDE_ANIMATION=300
CONFIG_LVGL_WIDGETS_USE_TILEVIEW=y
CONFIG_LVGL_WIDGETS_TILEVIEW_SLIDE_ANIMATION=300
# CONFIG_LVGL_WIDGETS_USE_WINDOW is not set
# end of Widgets

#
# Indev device settings
#
CONFIG_LVGL_INDEV_DEF_READ_PERIOD=30
CONFIG_LVGL_INDEV_DEF_DRAG_LIMIT=10
CONFIG_LVGL_INDEV_DEF_DRAG_THROW=10
CONFIG_LVGL_INDEV_DEF_LONG_PRESS_TIME=400
CONFIG_LVGL_INDEV_DEF_LONG_PRESS_REP_TIME=100
CONFIG_LVGL_INDEV_DEF_GESTURE_LIMIT=50
CONFIG_LVGL_INDEV_DEF_GESTURE_MIN_VELOCITY=3
# end of Indev device settings

#
# Feature usage
#
CONFIG_LVGL_FEATURE_USE_ANIMATION=y
CONFIG_LVGL_FEATURE_USE_SHADOW=y
CONFIG_LVGL_SHADOW_CACHE_SIZE=0
CONFIG_LVGL_FEATURE_USE_BLEND_MODES=y
CONFIG_LVGL_FEATURE_USE_OPA_SCALE=y
CONFIG_LVGL_FEATURE_USE_IMG_TRANSFORM=y
CONFIG_LVGL_FEATURE_USE_GROUP=y
# CONFIG_LVGL_FEATURE_USE_GPU is not set
# CONFIG_LVGL_FEATURE_USE_GPU_STM32_DMA2D is not set
CONFIG_LVGL_FEATURE_USE_FILESYSTEM=y
# CONFIG_LVGL_FEATURE_USE_USER_DATA is not set
# CONFIG_LVGL_FEATURE_USE_PERF_MONITOR is not set
CONFIG_LVGL_FEATURE_USE_API_EXTENSION_V6=y
# end of Feature usage

#
# Image decoder and cache
#
CONFIG_LVGL_IMG_CF_INDEXED=y
CONFIG_LVGL_IMG_CF_ALPHA=y
CONFIG_LVGL_IMG_CACHE_DEF_SIZE=1
# end of Image decoder and cache
# end of LVGL configuration
# end of Component config

#
# Compatibility options
#
# CONFIG_LEGACY_INCLUDE_COMMON_HEADERS is not set
# end of Compatibility options

# Deprecated options for backward compatibility
CONFIG_TOOLPREFIX="xtensa-esp32-elf-"
# CONFIG_LOG_BOOTLOADER_LEVEL_NONE is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_ERROR is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_WARN is not set
CONFIG_LOG_BOOTLOADER_LEVEL_INFO=y
# CONFIG_LOG_BOOTLOADER_LEVEL_DEBUG is not set
# CONFIG_LOG_BOOTLOADER_LEVEL_VERBOSE is not set
CONFIG_LOG_BOOTLOADER_LEVEL=3
# CONFIG_APP_ROLLBACK_ENABLE is not set
# CONFIG_FLASH_ENCRYPTION_ENABLED is not set
# CONFIG_FLASHMODE_QIO is not set
# CONFIG_FLASHMODE_QOUT is not set
CONFIG_FLASHMODE_DIO=y
# CONFIG_FLASHMODE_DOUT is not set
# CONFIG_MONITOR_BAUD_9600B is not set
# CONFIG_MONITOR_BAUD_57600B is not set
CONFIG_MONITOR_BAUD_115200B=y
# CONFIG_MONITOR_BAUD_230400B is not set
# CONFIG_MONITOR_BAUD_921600B is not set
# CONFIG_MONITOR_BAUD_2MB is not set
# CONFIG_MONITOR_BAUD_OTHER is not set
CONFIG_MONITOR_BAUD_OTHER_VAL=115200
CONFIG_MONITOR_BAUD=115200
CONFIG_COMPILER_OPTIMIZATION_LEVEL_DEBUG=y
# CONFIG_COMPILER_OPTIMIZATION_LEVEL_RELEASE is not set
# CONFIG_OPTIMIZATION_ASSERTIONS_ENABLED is not set
CONFIG_OPTIMIZATION_ASSERTIONS_SILENT=y
# CONFIG_OPTIMIZATION_ASSERTIONS_DISABLED is not set
CONFIG_OPTIMIZATION_ASSERTION_LEVEL=1
CONFIG_CXX_EXCEPTIONS=y
CONFIG_CXX_EXCEPTIONS_EMG_POOL_SIZE=0
# CONFIG_STACK_CHECK_NONE is not set
# CONFIG_STACK_CHECK_NORM is not set
CONFIG_STACK_CHECK_STRONG=y
# CONFIG_STACK_CHECK_ALL is not set
CONFIG_STACK_CHECK=y
# CONFIG_WARN_WRITE_STRINGS is not set
# CONFIG_DISABLE_GCC8_WARNINGS is not set
# CONFIG_ESP32_APPTRACE_DEST_TRAX is not set
CONFIG_ESP32_APPTRACE_DEST_NONE=y
CONFIG_ESP32_APPTRACE_LOCK_ENABLE=y
CONFIG_ADC2_DISABLE_DAC=y
# CONFIG_EVENT_LOOP_PROFILING is not set
CONFIG_POST_EVENTS_FROM_ISR=y
CONFIG_POST_EVENTS_FROM_IRAM_ISR=y
CONFIG_GDBSTUB_SUPPORT_TASKS=y
CONFIG_GDBSTUB_MAX_TASKS=32
# CONFIG_ESP32C3_LIGHTSLEEP_GPIO_RESET_WORKAROUND is not set
CONFIG_IPC_TASK_STACK_SIZE=1024
CONFIG_ESP32_PHY_CALIBRATION_AND_DATA_STORAGE=y
# CONFIG_ESP32_PHY_INIT_DATA_IN_PARTITION is not set
CONFIG_ESP32_PHY_MAX_WIFI_TX_POWER=20
CONFIG_ESP32_PHY_MAX_TX_POWER=20
CONFIG_ESP_SYSTEM_PM_POWER_DOWN_CPU=y
# CONFIG_ESP32S2_PANIC_PRINT_HALT is not set
# CONFIG_ESP32S2_PANIC_PRINT_REBOOT is not set
# CONFIG_ESP32S2_PANIC_SILENT_REBOOT is not set
CONFIG_ESP32S2_PANIC_GDBSTUB=y
CONFIG_ESP32S2_ALLOW_RTC_FAST_MEM_AS_HEAP=y
CONFIG_SYSTEM_EVENT_QUEUE_SIZE=32
CONFIG_SYSTEM_EVENT_TASK_STACK_SIZE=2304
CONFIG_MAIN_TASK_STACK_SIZE=6114
CONFIG_CONSOLE_UART_DEFAULT=y
# CONFIG_CONSOLE_UART_CUSTOM is not set
# CONFIG_ESP_CONSOLE_UART_NONE is not set
CONFIG_CONSOLE_UART=y
CONFIG_CONSOLE_UART_NUM=0
CONFIG_CONSOLE_UART_BAUDRATE=115200
# CONFIG_INT_WDT is not set
# CONFIG_TASK_WDT is not set
CONFIG_TIMER_TASK_STACK_SIZE=3584
# CONFIG_ESP32_ENABLE_COREDUMP_TO_FLASH is not set
# CONFIG_ESP32_ENABLE_COREDUMP_TO_UART is not set
CONFIG_ESP32_ENABLE_COREDUMP_TO_NONE=y
CONFIG_MB_MASTER_TIMEOUT_MS_RESPOND=150
CONFIG_MB_MASTER_DELAY_MS_CONVERT=200
CONFIG_MB_QUEUE_LENGTH=20
CONFIG_MB_SERIAL_TASK_STACK_SIZE=2048
CONFIG_MB_SERIAL_BUF_SIZE=256
CONFIG_MB_SERIAL_TASK_PRIO=10
# CONFIG_MB_CONTROLLER_SLAVE_ID_SUPPORT is not set
CONFIG_MB_CONTROLLER_NOTIFY_TIMEOUT=20
CONFIG_MB_CONTROLLER_NOTIFY_QUEUE_SIZE=20
CONFIG_MB_CONTROLLER_STACK_SIZE=4096
CONFIG_MB_EVENT_QUEUE_TIMEOUT=20
CONFIG_MB_TIMER_PORT_ENABLED=y
CONFIG_MB_TIMER_GROUP=0
CONFIG_MB_TIMER_INDEX=0
# CONFIG_ENABLE_STATIC_TASK_CLEAN_UP_HOOK is not set
CONFIG_TIMER_TASK_PRIORITY=1
CONFIG_TIMER_TASK_STACK_DEPTH=4096
CONFIG_TIMER_QUEUE_LENGTH=10
# CONFIG_L2_TO_L3_COPY is not set
# CONFIG_USE_ONLY_LWIP_SELECT is not set
CONFIG_ESP_GRATUITOUS_ARP=y
CONFIG_GARP_TMR_INTERVAL=60
CONFIG_TCPIP_RECVMBOX_SIZE=32
CONFIG_TCP_MAXRTX=12
CONFIG_TCP_SYNMAXRTX=6
CONFIG_TCP_MSS=1440
CONFIG_TCP_MSL=60000
CONFIG_TCP_SND_BUF_DEFAULT=5744
CONFIG_TCP_WND_DEFAULT=5744
CONFIG_TCP_RECVMBOX_SIZE=6
CONFIG_TCP_QUEUE_OOSEQ=y
# CONFIG_ESP_TCP_KEEP_CONNECTION_WHEN_IP_CHANGES is not set
CONFIG_TCP_OVERSIZE_MSS=y
# CONFIG_TCP_OVERSIZE_QUARTER_MSS is not set
# CONFIG_TCP_OVERSIZE_DISABLE is not set
CONFIG_UDP_RECVMBOX_SIZE=6
CONFIG_TCPIP_TASK_STACK_SIZE=8192
CONFIG_TCPIP_TASK_AFFINITY_NO_AFFINITY=y
# CONFIG_TCPIP_TASK_AFFINITY_CPU0 is not set
# CONFIG_TCPIP_TASK_AFFINITY_CPU1 is not set
CONFIG_TCPIP_TASK_AFFINITY=0x7FFFFFFF
CONFIG_PPP_SUPPORT=y
CONFIG_PPP_NOTIFY_PHASE_SUPPORT=y
CONFIG_PPP_PAP_SUPPORT=y
# CONFIG_PPP_CHAP_SUPPORT is not set
# CONFIG_PPP_MSCHAP_SUPPORT is not set
# CONFIG_PPP_MPPE_SUPPORT is not set
# CONFIG_PPP_DEBUG_ON is not set
CONFIG_ESP32_PTHREAD_TASK_PRIO_DEFAULT=5
CONFIG_ESP32_PTHREAD_TASK_STACK_SIZE_DEFAULT=3072
CONFIG_ESP32_PTHREAD_STACK_MIN=768
CONFIG_ESP32_DEFAULT_PTHREAD_CORE_NO_AFFINITY=y
# CONFIG_ESP32_DEFAULT_PTHREAD_CORE_0 is not set
# CONFIG_ESP32_DEFAULT_PTHREAD_CORE_1 is not set
CONFIG_ESP32_PTHREAD_TASK_CORE_DEFAULT=-1
CONFIG_ESP32_PTHREAD_TASK_NAME_DEFAULT="pthread"
CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_ABORTS=y
# CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_FAILS is not set
# CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_ALLOWED is not set
# CONFIG_USB_ENABLED is not set
CONFIG_SUPPRESS_SELECT_DEBUG_OUTPUT=y
CONFIG_SUPPORT_TERMIOS=y
CONFIG_SEMIHOSTFS_MAX_MOUNT_POINTS=1
CONFIG_SEMIHOSTFS_HOST_PATH_MAX_LEN=128
# End of deprecated options
